# Ejemplo práctico para Pandas con Dataframes

## 1. Inspección inicial del dataframe

In [ ]:
# Importación de librerias
import pandas as pd

In [ ]:
# Crear un dataframe a partir de un diccionario
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Lucia', 'Martha',  'Jorge', 'Sofia'],
    'Edad': [23,25,45,25,30,38,32],
    'Ciudad': ['CDMX', 'Guadalajara', 'Monterrey', 'CDMX' ,'Puebla', 'CDMX', 'Guadalajara'],
    'Salario': [12000, 15000, 18000, 12500, 14000, 13000, 15500],
    'Departamento': ['Ventas', 'Marketing', 'Ventas', 'TI', 'TI', 'Marketing', 'Ventas' ]
}

In [ ]:
df = pd.DataFrame(data)
df

## 2. Estructura y Resumen del DataFrame

In [ ]:
df.info()

In [ ]:
df.describe()

In [ ]:
# Muestra el tamaño del dataframe
df.shape

In [ ]:
# Numero de filas
df.shape[0]

# Numero de columnas
df.shape[1]

In [ ]:
# Muestra los tipos de datos de las columnas
df.dtypes

In [ ]:
# Muestra el nombre de las columnas
df.columns

In [ ]:
# Los indices
df.index

## 3. Selección de columnas y filas (Segmentación)

In [ ]:
# Selecciona una sola columna del dataframe como una serie
df['Edad']

In [ ]:
type(df['Edad'])

In [ ]:
df[['Edad']]

In [ ]:
df[['Nombre', 'Salario']]

## 4. Filtrado de Filas

In [ ]:
# Filtrar todas las filas que la ciudad sea CDMX
df[df['Ciudad'] == 'CDMX']

In [ ]:
df[df['Ciudad'] == 'CDMX'][['Nombre', 'Ciudad', 'Salario']]

In [ ]:
df_cdmx = df[df['Ciudad'] == 'CDMX']

In [ ]:
df_cdmx [['Nombre', 'Ciudad', 'Salario']]

In [ ]:
# Mostrar todas las filas de la Ciudad de México y del departamento de TI
df[(df['Ciudad'] == 'CDMX') & (df['Departamento']== 'TI')]

In [ ]:
# Mostrar todas las filas de la Ciudad de México o del departamento de TI
df[(df['Ciudad'] == 'CDMX') | (df['Departamento']== 'TI')]

In [42]:
## Ordenar por salsario de forma ascendente
df.sort_values(by = 'Salario', ascending=True)

   Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
3   Lucia    25         CDMX    12500           TI
5   Jorge    38         CDMX    13000    Marketing
4  Martha    30       Puebla    14000           TI
1    Luis    25  Guadalajara    15000    Marketing
6   Sofia    32  Guadalajara    15500       Ventas
2  Carlos    45    Monterrey    18000       Ventas

In [43]:
## Ordenar por salsario de forma descendetne
df.sort_values(by = 'Salario', ascending=False)

   Nombre  Edad       Ciudad  Salario Departamento
2  Carlos    45    Monterrey    18000       Ventas
6   Sofia    32  Guadalajara    15500       Ventas
1    Luis    25  Guadalajara    15000    Marketing
4  Martha    30       Puebla    14000           TI
5   Jorge    38         CDMX    13000    Marketing
3   Lucia    25         CDMX    12500           TI
0     Ana    23         CDMX    12000       Ventas

# Ordenar por el salsario y la ciudad

In [ ]:
# Ordenar por el salsario y la ciudad
df.sort_values(by =['Ciudad', 'Salario'])

   Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
3   Lucia    25         CDMX    12500           TI
5   Jorge    38         CDMX    13000    Marketing
1    Luis    25  Guadalajara    15000    Marketing
6   Sofia    32  Guadalajara    15500       Ventas
2  Carlos    45    Monterrey    18000       Ventas
4  Martha    30       Puebla    14000           TI

In [45]:
df.sort_values(by=['Ciudad', 'Salario'], ascending=[True, False])

   Nombre  Edad       Ciudad  Salario Departamento
5   Jorge    38         CDMX    13000    Marketing
3   Lucia    25         CDMX    12500           TI
0     Ana    23         CDMX    12000       Ventas
6   Sofia    32  Guadalajara    15500       Ventas
1    Luis    25  Guadalajara    15000    Marketing
2  Carlos    45    Monterrey    18000       Ventas
4  Martha    30       Puebla    14000           TI

In [ ]:
df.sort_values(by=['Salario', 'Ciudad'], ascending=[True, False])

   Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
3   Lucia    25         CDMX    12500           TI
5   Jorge    38         CDMX    13000    Marketing
4  Martha    30       Puebla    14000           TI
1    Luis    25  Guadalajara    15000    Marketing
6   Sofia    32  Guadalajara    15500       Ventas
2  Carlos    45    Monterrey    18000       Ventas

In [ ]:
##  6. Crear nuevas columnas

df.sort_values(by=['Ciudad', 'Salario'], ascending=[True, False])